performance-test-reports/next-updates/12533174691/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2024-12-29T06:32:09Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  97% — ✓ 327429 / ✗ 6687
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 1952
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1265
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3470

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  97% — ✓ 327429 / ✗ 6687
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  97% — ✓ 327429 / ✗ 6687
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6687    7.51336/s
-    _response_success_cnt..........: 327429  367.891725/s
-    _response_total_cnt............: 334116  375.405085/s
-    checks.........................: 99.32%  ✓ 3955896     ✗ 26748 
-    data_received..................: 116 MB  130 kB/s
-    data_sent......................: 78 MB   87 kB/s
-    dropped_iterations.............: 1627913 1829.085761/s
-    group_duration.................: avg=928.63ms min=237.15µs med=2.58ms   max=1m1s     p(90)=1.27s    p(95)=2.5s  
-    http_req_blocked...............: avg=463.41ms min=0s       med=179.9µs  max=19.65s   p(90)=1.03s    p(95)=2.06s 
-    http_req_connecting............: avg=463.33ms min=0s       med=139.99µs max=19.65s   p(90)=1.03s    p(95)=2.06s 
-  ✗ http_req_duration..............: avg=1.27s    min=0s       med=252.45ms max=59.82s   p(90)=738.57ms p(95)=1.53s 
-      { expected_response:true }...: avg=536.58ms min=1.37ms   med=252.01ms max=57.98s   p(90)=663.21ms p(95)=1.14s 
-  ✗ http_req_failed................: 2.00%   ✓ 6687        ✗ 327429
-    http_req_receiving.............: avg=1.35ms   min=0s       med=88.84µs  max=241.6ms  p(90)=1.43ms   p(95)=3.56ms
-    http_req_sending...............: avg=853.15µs min=0s       med=35.51µs  max=184.25ms p(90)=234.2µs  p(95)=1.27ms
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s    
-    http_req_waiting...............: avg=1.27s    min=0s       med=251.78ms max=59.81s   p(90)=732.9ms  p(95)=1.52s 
-    http_reqs......................: 334116  375.405085/s
-    iteration_duration.............: avg=1.85s    min=3.44ms   med=260.54ms max=1m1s     p(90)=2.5s     p(95)=5.12s 
-    iterations.....................: 334116  375.405085/s
-    vus............................: 1       min=0         max=1000
-    vus_max........................: 1000    min=345       max=1000